---
kind: type
id: T:Autodesk.Revit.UI.Macros.UIMacroManager
source: html/187bf41e-4d8a-ecaf-d5f6-2579f9290681.htm
---
# Autodesk.Revit.UI.Macros.UIMacroManager

The UI macro manager to support Macro operations related to the sharp develop IDE.

## Syntax (C#)
```csharp
public class UIMacroManager : IDisposable
```